// ignore_for_file: omit_local_variable_types, prefer_final_locals, noop_primitive_operations, lines_longer_than_80_chars
import 'dart:math';

void main() {
  task1();
  task2();
  task3();
  task4();
  task5();
  task6();
  task7();
  task8();
  task9();
  task10();
}

/// Завдання 1: Математичні оператори
/// Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
///
/// Обчисліть площу і периметр прямокутника.
/// Виведіть площу і периметр.
/// Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
void task1() {
  final width = 18.4;
  final height = 30.9;

  final area = width * height;

  print('=== task1');
  print('площа прямокутника = $area');
  print('периметр прямокутника = ${(width + height) * 2}');

  final count = area ~/ 1;
  print('повних квадратів 1х1 вміщається у площу = $count');
}

/// Завдання 2: Оператори порівняння
/// Створіть змінну number.
///
/// Перевірте:
/// Чи більше число за 50.
/// Чи менше число за 100.
/// Чи ділиться число на 5 без залишку.
/// Виведіть всі результати.
void task2() {
  final number = Random().nextInt(101);

  print('=== task2');
  // Використовується Switch Expression з Pattern Matching
  final result = switch (number) {
    > 50 && < 100 when number % 5 == 0 =>
      'Число $number більше 50, менше 100 та ділиться на 5 без залишку!',

    > 50 && < 100 => 'Число $number між 50 або 100, але не ділиться на 5',

    < 50 when number % 5 == 0 => 'Число менше 50 та ділитися на 5',

    _ => 'Число $number менше 50 та не ділитися на 5',
  };

  // не працює без Pattern Matching
  // final message = switch (number) {
  // > 50 && < 100 && == (number ~/ 5 * 5) => 'Більше 50, менше 100 і ділиться на 5',
  // > 50 && < 100 => 'Між 50 і 100, але на 5 не ділиться',
  // _ => 'Не потрапляє в діапазон чи інші умови'
  //};
  print(result);
}

/// Завдання 3: Логічні оператори
/// Створіть змінні hasMoney і isStoreOpen (типу bool).
///
/// Перевірте:
/// Чи можна зробити покупку (якщо є гроші і магазин відкритий).
/// Чи потрібно почекати (якщо магазин закритий або немає грошей).
/// Використайте оператори &&, ||, !.
void task3() {
  final random = Random();

  // Генерация случайных состояний
  bool hasMoney = random.nextBool();
  bool isStoreOpen = random.nextBool();

  print('=== task3');
  print('hasMoney: $hasMoney');
  print('isStoreOpen: $isStoreOpen');
  if (hasMoney && isStoreOpen) {
    print('Результат if: Покупка дозволена');
  } else if (!isStoreOpen || !hasMoney) {
    print('Результат if: Треба почекати');
  }
}

/// Завдання 4: Тернарний оператор
/// Створіть змінну temperature.
///
/// Використайте тернарний оператор, щоб визначити:
/// Якщо більше 25 — “Тепло”.
/// Якщо менше або дорівнює 25 — “Прохолодно”.
/// Потім створіть ще один тернарний оператор:
/// Якщо менше 10 — вивести “Дуже холодно”.

void task4() {
  final random = Random();
  int temperature = -20 + random.nextInt(61);

  print('=== task4');
  print('temperature: $temperature');
  final status = temperature > 25 ? 'Тепло' : 'Прохолодно';
  print(status);

  final alert = temperature < 10 ? 'Дуже холодно' : 'Дивись відповідь вище :)';
  print(alert);
}

/// Завдання 5: Оператори присвоєння
/// Використовувати тільки оператори присвоєння (+=, -=, *=, /=)
///
/// Створіть змінну score = 0.
/// Створіть зміни з даними:
/// correctAnswers = 17;
/// mistakes = 3;
/// totalQuestions = 20;
///
/// Додайте 10 балів за кожну правильну відповідь.
/// Відніміть 5 балів за кожну помилку.
///
/// Збільшіть загальну кількість балів у 2 рази.
/// Поділіть бали на кількість запитань.
/// Виведіть остаточний результат.

void task5() {
  double score = 0;
  final correctAnswers = 17;
  final mistakes = 3;
  final totalQuestions = 20;

  print('=== task5');

  score += correctAnswers * 10;
  print('Додаємо 10 балів за кожну правильну відповідь: $score');

  score -= mistakes * 5;
  print('Віднімаємо 5 балів за кожну помилку: $score');

  score *= 2;
  print('Збільшуємо загальну кількість балів у 2 рази: $score');

  score /= totalQuestions;
  print('Ділимо бали на кількість запитань: $score');
}

/// Завдання 6: Умовні конструкції if/else
/// Створіть змінну examScore з значенням 56
/// Створіть умовні конструкції if / else if / else
/// Якщо більше 90 — вивести “Відмінно”.
///
/// Якщо 75–90 — “Добре”.
/// Якщо 60–74 — “Задовільно”.
/// Якщо менше 60 — “Не здано”.
///
/// Додатково: якщо оцінка менше 20 — вивести “Повторити курс”.
/// Поексперементуйте, змінюючи  значення examScore

void task6() {
  final examScore = Random().nextInt(101);

  print('=== task6');
  print('Оцінка: $examScore');

  if (examScore > 90) {
    print('Відмінно');
  } else if (examScore >= 75) {
    // Сработает для 75-90
    print('Добре');
  } else if (examScore >= 60) {
    // Сработает для 60-74
    print('Задовільно');
  } else if (examScore > 20) {
    // Сработает для 20-59
    print('Не здано');
  } else {
    // Все, что меньше 20
    print('Повторити курс');
  }
}

/// Завдання 7: Конструкція switch statement
/// Створіть змінну dayNumber від 1 до 7.
///
/// Використайте switch, щоб вивести:
/// Понеділок, Вівторок, …, Неділя.
/// Якщо день не від 1 до 7 — вивести “Невірний номер дня”.
/// Додатково: для вихідних (6, 7) вивести “Вихідний день 🎉”.

void task7() {}

/// Завдання 8: Цикли for
/// Виведіть всі числа від 1 до 10.
/// Виведіть тільки парні числа.
/// Обчисліть суму чисел від 1 до 10.

void task8() {}

/// Завдання 9: Цикл while
/// Почніть із числа 10.
///
/// Виводьте числа, зменшуючи їх на 1, поки не досягнете 0.
/// Якщо число парне — вивести “Парне число: …”,
/// якщо непарне — “Непарне число: …”.

void task9() {}

/// Завдання 10: Break і Continue
/// Створіть цикл for від 1 до 20.
///
/// Якщо число ділиться на 3 без залишку — пропустіть його (continue).
/// Якщо число більше 15 — зупиніть цикл (break).
/// Виведіть тільки ті числа, які пройшли обидві перевірки.
void task10() {}
